dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_OFF (28u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_OFF (30u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_OFF (1u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_OFF (2u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_OFF (3u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_OFF (4u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_OFF (5u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_OFF (6u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_OFF (7u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_OFF (9u)

/** \brief Length for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_OFF (0u)

/** \brief Length for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_LEN (2u)

/** \brief Mask for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_MSK (0x3u)

/** \brief Offset for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN0 */
#define IFX_CPU_RGN_ACCENA_EN0_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN0 */
#define IFX_CPU_RGN_ACCENA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN0 */
#define IFX_CPU_RGN_ACCENA_EN0_OFF (0u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN1 */
#define IFX_CPU_RGN_ACCENA_EN1_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN1 */
#define IFX_CPU_RGN_ACCENA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN1 */
#define IFX_CPU_RGN_ACCENA_EN1_OFF (1u)

