dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCpu_bf.h
/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN23 */
#define IFX_CPU_RGN_ACCENA_EN23_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN23 */
#define IFX_CPU_RGN_ACCENA_EN23_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN23 */
#define IFX_CPU_RGN_ACCENA_EN23_OFF (23u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN24 */
#define IFX_CPU_RGN_ACCENA_EN24_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN24 */
#define IFX_CPU_RGN_ACCENA_EN24_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN24 */
#define IFX_CPU_RGN_ACCENA_EN24_OFF (24u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN25 */
#define IFX_CPU_RGN_ACCENA_EN25_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN25 */
#define IFX_CPU_RGN_ACCENA_EN25_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN25 */
#define IFX_CPU_RGN_ACCENA_EN25_OFF (25u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN26 */
#define IFX_CPU_RGN_ACCENA_EN26_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN26 */
#define IFX_CPU_RGN_ACCENA_EN26_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN26 */
#define IFX_CPU_RGN_ACCENA_EN26_OFF (26u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN27 */
#define IFX_CPU_RGN_ACCENA_EN27_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN27 */
#define IFX_CPU_RGN_ACCENA_EN27_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN27 */
#define IFX_CPU_RGN_ACCENA_EN27_OFF (27u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN28 */
#define IFX_CPU_RGN_ACCENA_EN28_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN28 */
#define IFX_CPU_RGN_ACCENA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN28 */
#define IFX_CPU_RGN_ACCENA_EN28_OFF (28u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN29 */
#define IFX_CPU_RGN_ACCENA_EN29_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN29 */
#define IFX_CPU_RGN_ACCENA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN29 */
#define IFX_CPU_RGN_ACCENA_EN29_OFF (29u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN30 */
#define IFX_CPU_RGN_ACCENA_EN30_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN30 */
#define IFX_CPU_RGN_ACCENA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN30 */
#define IFX_CPU_RGN_ACCENA_EN30_OFF (30u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN31 */
#define IFX_CPU_RGN_ACCENA_EN31_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN31 */
#define IFX_CPU_RGN_ACCENA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN31 */
#define IFX_CPU_RGN_ACCENA_EN31_OFF (31u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN32 */
#define IFX_CPU_RGN_ACCENB_EN32_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN32 */
#define IFX_CPU_RGN_ACCENB_EN32_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN32 */
#define IFX_CPU_RGN_ACCENB_EN32_OFF (0u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN33 */
#define IFX_CPU_RGN_ACCENB_EN33_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN33 */
#define IFX_CPU_RGN_ACCENB_EN33_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN33 */
#define IFX_CPU_RGN_ACCENB_EN33_OFF (1u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN34 */
#define IFX_CPU_RGN_ACCENB_EN34_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN34 */
#define IFX_CPU_RGN_ACCENB_EN34_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN34 */
#define IFX_CPU_RGN_ACCENB_EN34_OFF (2u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN35 */
#define IFX_CPU_RGN_ACCENB_EN35_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN35 */
#define IFX_CPU_RGN_ACCENB_EN35_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN35 */
#define IFX_CPU_RGN_ACCENB_EN35_OFF (3u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN36 */
#define IFX_CPU_RGN_ACCENB_EN36_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN36 */
#define IFX_CPU_RGN_ACCENB_EN36_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN36 */
#define IFX_CPU_RGN_ACCENB_EN36_OFF (4u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN37 */
#define IFX_CPU_RGN_ACCENB_EN37_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN37 */
#define IFX_CPU_RGN_ACCENB_EN37_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN37 */
#define IFX_CPU_RGN_ACCENB_EN37_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN38 */
#define IFX_CPU_RGN_ACCENB_EN38_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN38 */
#define IFX_CPU_RGN_ACCENB_EN38_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN38 */
#define IFX_CPU_RGN_ACCENB_EN38_OFF (6u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN39 */
#define IFX_CPU_RGN_ACCENB_EN39_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN39 */
#define IFX_CPU_RGN_ACCENB_EN39_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN39 */
#define IFX_CPU_RGN_ACCENB_EN39_OFF (7u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN40 */
#define IFX_CPU_RGN_ACCENB_EN40_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN40 */
#define IFX_CPU_RGN_ACCENB_EN40_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN40 */
#define IFX_CPU_RGN_ACCENB_EN40_OFF (8u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN41 */
#define IFX_CPU_RGN_ACCENB_EN41_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN41 */
#define IFX_CPU_RGN_ACCENB_EN41_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN41 */
#define IFX_CPU_RGN_ACCENB_EN41_OFF (9u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN42 */
#define IFX_CPU_RGN_ACCENB_EN42_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN42 */
#define IFX_CPU_RGN_ACCENB_EN42_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN42 */
#define IFX_CPU_RGN_ACCENB_EN42_OFF (10u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN43 */
#define IFX_CPU_RGN_ACCENB_EN43_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN43 */
#define IFX_CPU_RGN_ACCENB_EN43_MSK (0x1u)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN43 */
#define IFX_CPU_RGN_ACCENB_EN43_OFF (11u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN44 */
#define IFX_CPU_RGN_ACCENB_EN44_LEN (1u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN44 */
#define IFX_CPU_RGN_ACCENB_EN44_MSK (0x1u)

